tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "FelixKratz/formulae"
tap "koekeishiya/formulae"

# Binaries
brew 'bat'
brew 'exa'
brew 'jq'
brew 'gh'
brew 'mas'
brew 'switchaudio-osx'
brew 'ffmpeg'
brew 'fzf'
brew 'tmux'
brew 'zoxide'
brew 'neovim'
brew 'zsh'
brew 'skhd'
brew 'starship'
brew 'koekeishiya/formulae/yabai'
brew 'sketchybar'

# Developer Tools
brew 'azure-cli'
brew 'git'
brew 'git-lfs'
brew 'rust-analyzer'
brew 'git-crypt'
brew 'gnupg'
brew 'imagemagick'
brew 'n'
brew 'mysql'
brew 'redis'
brew 'yarn'
brew 'kubectl'
brew 'minikube'

# Applications
cask 'arc'
cask 'iterm2'
cask 'raycast'
cask 'bitwarden'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'jetbrains-toolbox'
cask 'keybase'
cask 'spotiy'
cask 'miro'
cask 'postman'
cask 'slack'
cask 'visual-studio-code'
cask 'microsoft-teams'
cask 'obsidian'
cask 'sf-symbols'

# Fonts
cask 'font-fira-code-nerd-font'
